app/controllers/v1/greetings_controller.rb

  def index
    message = Greeting.find(rand(1..5)).greeting
---
SELECT "greetings".* FROM "greetings" WHERE "greetings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]